### Author: Uday Routhu

### assignment: Project 3 - Part 3 (Core)

#### Imports

In [156]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pandas as pd
from urllib.parse import quote_plus as urlquote
from sqlalchemy.types import *

In [157]:
import os, time,json
import tmdbsimple as tmdb 
FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

['.ipynb_checkpoints',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json',
 'tmdb_results_combined.csv.gz']

In [158]:
with open('/Users/uurou/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

#### create database

In [159]:
db_name = "movies"
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/{db_name}"
#create engine
engine = create_engine(connection)

In [160]:
#Create database
create_database(connection)

In [161]:
#To verify that the database was created
database_exists(connection)

True

In [162]:
title_basics = pd.read_csv('Data/title_basics.csv.gz')

In [163]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81891 entries, 0 to 81890
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81891 non-null  object
 1   titleType       81891 non-null  object
 2   primaryTitle    81891 non-null  object
 3   originalTitle   81891 non-null  object
 4   isAdult         81891 non-null  int64
 5   startYear       81891 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81891 non-null  int64
 8   genres          81891 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 5.6+ MB

#### Filtered titile basics

In [164]:
# Define the columns to keep
columns_to_keep = ['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes', 'genres']

# Create a new DataFrame with only the selected columns
title_basics_filtered = title_basics[columns_to_keep]

# Display the first few rows of the filtered DataFrame
print(title_basics_filtered.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81891 entries, 0 to 81890
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81891 non-null  object
 1   primaryTitle    81891 non-null  object
 2   startYear       81891 non-null  float64
 3   runtimeMinutes  81891 non-null  int64
 4   genres          81891 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 3.1+ MB
None

#### creating title genres

In [165]:
## create a col with a list of genres
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
81886,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
81887,tt9915872,movie,The Last White Witch,Boku no kanojo wa mahoutsukai,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81888,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
81889,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81890,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [166]:
exploded_genres = title_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
81889,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81889,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81889,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81890,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
81890,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [167]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [168]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [169]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres,genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [170]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)

In [171]:
title_genres = title_genres.drop(columns='genres_split')

In [172]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

#### creating genres

In [173]:
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [174]:
genres = pd.DataFrame({'genre_name': genre_id_map.keys(),'genre_id':genre_id_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

#### Loading title rating

In [175]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')

In [176]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 68089 entries, 0 to 68088
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         68089 non-null  object
 1   averageRating  68089 non-null  float64
 2   numVotes       68089 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

#### Loading TMDB results

In [177]:
tmdb_api_results = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [178]:
tmdb_api_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3035 entries, 0 to 3034
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                3035 non-null   object
 1   adult                  3035 non-null   float64
 2   backdrop_path          3035 non-null   object
 3   belongs_to_collection  0 non-null      float64
 4   budget                 3035 non-null   float64
 5   genres                 3035 non-null   object
 6   homepage               3035 non-null   object
 7   id                     3035 non-null   float64
 8   original_language      3035 non-null   object
 9   original_title         3035 non-null   object
 10  overview               3035 non-null   object
 11  popularity             3035 non-null   float64
 12  poster_path            3035 non-null   object
 13  production_companies   3035 non-null   object
 14  production_countries   3035 non-null   object
 15  release_date           3035 non-null   object
 16  revenue                3035 non-null   float64
 17  runtime                3035 non-null   float64
 18  spoken_languages       3035 non-null   object
 19  status                 3035 non-null   object
 20  tagline                3035 non-null   object
 21  title                  3035 non-null   object
 22  video                  3035 non-null   float64
 23  vote_average           3035 non-null   float64
 24  vote_count             3035 non-null   float64
 25  certification          3035 non-null   object
dtypes: float64(10), object(16)
memory usage: 616.6+ KB

In [179]:
tmdb_api_results.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt1361336,0.0,/9ns9463dwOeo1CK1JU2wirL5Yi1.jpg,NaN,50000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",https://www.tomandjerrymovie.com,587807.0,en,Tom & Jerry,...,136536687.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Best of enemies. Worst of friends.,Tom & Jerry,0.0,6.868,2285.0,PG
1,tt1361336,0.0,/9ns9463dwOeo1CK1JU2wirL5Yi1.jpg,NaN,50000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",https://www.tomandjerrymovie.com,587807.0,en,Tom & Jerry,...,136536687.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Best of enemies. Worst of friends.,Tom & Jerry,0.0,6.868,2285.0,PG
2,tt1361336,0.0,/9ns9463dwOeo1CK1JU2wirL5Yi1.jpg,NaN,50000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",https://www.tomandjerrymovie.com,587807.0,en,Tom & Jerry,...,136536687.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Best of enemies. Worst of friends.,Tom & Jerry,0.0,6.868,2285.0,PG
3,tt1361336,0.0,/9ns9463dwOeo1CK1JU2wirL5Yi1.jpg,NaN,50000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",https://www.tomandjerrymovie.com,587807.0,en,Tom & Jerry,...,136536687.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Best of enemies. Worst of friends.,Tom & Jerry,0.0,6.868,2285.0,PG
4,tt1361336,0.0,/9ns9463dwOeo1CK1JU2wirL5Yi1.jpg,NaN,50000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",https://www.tomandjerrymovie.com,587807.0,en,Tom & Jerry,...,136536687.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Best of enemies. Worst of friends.,Tom & Jerry,0.0,6.868,2285.0,PG

In [180]:
# Define the columns to keep
columns_to_keep = ['imdb_id', 'revenue', 'budget', 'certification']

# Create a new DataFrame with only the selected columns
tmdb_filtered = tmdb_api_results[columns_to_keep]
tmdb_filtered = tmdb_filtered.drop_duplicates(subset=['imdb_id'])

# Display the first few rows of the filtered DataFrame
print(tmdb_filtered.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 0 to 0
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        1 non-null      object
 1   revenue        1 non-null      float64
 2   budget         1 non-null      float64
 3   certification  1 non-null      object
dtypes: float64(2), object(2)
memory usage: 40.0+ bytes
None

### Create title_basics Table in My Sql

#### Creating a dataype schema for to_sql:

In [181]:
title_basics_filtered.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81891 entries, 0 to 81890
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81891 non-null  object
 1   primaryTitle    81891 non-null  object
 2   startYear       81891 non-null  float64
 3   runtimeMinutes  81891 non-null  int64
 4   genres          81891 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 3.1+ MB

In [182]:
## Calculate max string lengths for object columns
key_len = title_basics_filtered['tconst'].fillna('').map(len).max()
title_len = title_basics_filtered['primaryTitle'].fillna('').map(len).max()
gen_len = title_basics_filtered['genres'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer(),
    'genres': String(gen_len+1)}

In [183]:
# Save to sql with dtype and index=False
title_basics_filtered.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

81891

In [184]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [185]:
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0068865,Lives of Performers,2016.0,90,Drama
3,tt0069049,The Other Side of the Wind,2018.0,122,Drama
4,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"

### Create title_ratings Table in My Sql

#### Creating a dataype schema for to_sql:

In [186]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 68089 entries, 0 to 68088
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         68089 non-null  object
 1   averageRating  68089 non-null  float64
 2   numVotes       68089 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

In [187]:
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating': Float(),
    'numVotes':Integer()}

In [188]:
# Save to sql with dtype and index=False
title_ratings.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

68089

In [189]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [190]:
q = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0035423            6.4     87560
1  tt0062336            6.4       180
2  tt0068865            5.4        74
3  tt0069049            6.7      7828
4  tt0088751            5.2       340

### Create title_genres Table in My Sql

#### Creating a dataype schema for to_sql:

In [191]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153609 entries, 0 to 81890
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    153609 non-null  object
 1   genre_id  153609 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [192]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [193]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

153609

In [194]:
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0068865         7

### Create genres Table in My Sql

#### Creating a dataype schema for to_sql:

In [195]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [196]:
## Calculate max string lengths for object columns
key_len = genres['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_name": String(key_len+1), 
    'genre_id':Integer()}

In [197]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=df_schema,if_exists='replace',index=False)

25

In [198]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [199]:
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Create genres Table in My Sql

#### Creating a dataype schema for to_sql:

In [200]:
tmdb_filtered.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 0 to 0
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        1 non-null      object
 1   revenue        1 non-null      float64
 2   budget         1 non-null      float64
 3   certification  1 non-null      object
dtypes: float64(2), object(2)
memory usage: 40.0+ bytes

In [201]:
## Calculate max string lengths for object columns
key_len = tmdb_filtered['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_filtered['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    'revenue':Float(),
    'budget':Float(),
    'certification':String(cert_len+1)}

In [202]:
# Save to sql with dtype and index=False
tmdb_filtered.to_sql('tmdb_data',engine,dtype=df_schema,if_exists='replace',index=False)

1

In [203]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [204]:
q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id      revenue      budget certification
0  tt1361336  136537000.0  50000000.0            PG

### SHOW TABLES IN MOVIES DATABASE

In [205]:
q= """SHOW TABLES"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data